{
  "id": "f37eb0ba-79c2-4b79-9b0e-05caa9987649",
  "position": "Head of Online Marketing part-time/full-time",
  "description": "We are looking for a Head of Online to manage this department. Reporting to the General Manager they will be responsible for managing the online marketing department, as well as managing the Online Marketing Assistant.\n\n\nResponsibilities:\n\n\n\nManage the online department and coordinate tasks to optimise performance and streamline processes\nEnsuring that the online products we provide to our clients are of a high standard.\nManage KPIs, grow department revenue, grow client base, and manage client expectations\nManage Facebook and Google clients - setup and optimisation of Facebook and Google accounts. We can provide training on the Google products for you to manage going forward\nAllocate and delegate tasks to the Online Marketing Assistant\nCoordinate billing for all clients and manage financial aspects of all marketing campaigns\nProduce monthly reports for all clients, analysing campaign performance, insights, and recommendations for improvement\nAssist support and sales teams as needed\nDrive online marketing sales campaigns with the sales team.\n\n\nRequirements:\n\nExperience with Meta Business Suite, Canva, Facebook Ads \nExperience in customer service and team management\nExcellent communication skills (written and verbal).\nHighly organised with excellent time management skills and a strong attention to detail \nInnovative and creative mindset.\n\n\nExperience in real estate would be advantageous.\n\nThis role is required for a minimum of 4 hours per day during office hours and is a hybrid working model. \n\nSalary range: R10 000,00 - R22 000,00 per month (negotiable)",
  "types": "experience,leadership",
  "duration": "15",
  "questions": [
    {
      "category": "Experience",
      "question": "Can you provide an example of how you managed and optimized online marketing campaigns in your previous roles?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "Experience",
      "question": "How have you successfully managed client expectations in previous online marketing positions?",
      "expectedDuration": 2,
      "difficulty": "easy"
    },
    {
      "category": "Experience",
      "question": "Can you explain a situation where you identified areas for improvement in online marketing strategies and how you addressed them?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "Leadership",
      "question": "Describe your approach to managing and coordinating tasks within the online marketing department to optimize performance.",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "Leadership",
      "question": "How have you allocated tasks and delegated responsibilities to your team members in the past to ensure efficient workflow?",
      "expectedDuration": 2,
      "difficulty": "easy"
    },
    {
      "category": "Technical",
      "question": "What experience do you have with Meta Business Suite, Canva, and Facebook Ads, and how have you utilized these tools in your previous roles?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "Behavioral",
      "question": "Can you provide an example of a time when you had to deal with a challenging client in the online marketing space? How did you handle the situation?",
      "expectedDuration": 3,
      "difficulty": "medium"
    }
  ],
  "createdAt": "2025-04-12T13:22:01.754Z"
}