{
  "id": "6b50818c-0181-4a3b-845f-f1121336f617",
  "position": "Head of Online Marketing part-time/full-time",
  "description": "We are looking for a Head of Online to manage this department. Reporting to the General Manager they will be responsible for managing the online marketing department, as well as managing the Online Marketing Assistant.\n\n\nResponsibilities:\n\n\n\nManage the online department and coordinate tasks to optimise performance and streamline processes\nEnsuring that the online products we provide to our clients are of a high standard.\nManage KPIs, grow department revenue, grow client base, and manage client expectations\nManage Facebook and Google clients - setup and optimisation of Facebook and Google accounts. We can provide training on the Google products for you to manage going forward\nAllocate and delegate tasks to the Online Marketing Assistant\nCoordinate billing for all clients and manage financial aspects of all marketing campaigns\nProduce monthly reports for all clients, analysing campaign performance, insights, and recommendations for improvement\nAssist support and sales teams as needed\nDrive online marketing sales campaigns with the sales team.\n\n\nRequirements:\n\nExperience with Meta Business Suite, Canva, Facebook Ads \nExperience in customer service and team management\nExcellent communication skills (written and verbal).\nHighly organised with excellent time management skills and a strong attention to detail \nInnovative and creative mindset.\n\n\nExperience in real estate would be advantageous.\nThis role is required for a minimum of 4 hours per day during office hours and is a hybrid working model. \n\nSalary range: R10 000,00 - R22 000,00 per month (negotiable)",
  "types": "behavioral,leadership,sales",
  "duration": "15",
  "questions": [
    {
      "category": "behavioral",
      "question": "Can you provide an example of a time when you successfully managed a team and improved their performance?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "behavioral",
      "question": "How do you handle challenging clients and manage their expectations effectively?",
      "expectedDuration": 2,
      "difficulty": "easy"
    },
    {
      "category": "behavioral",
      "question": "Describe a situation where you had to coordinate with multiple teams to accomplish a marketing goal. How did you ensure effective collaboration?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "leadership",
      "question": "How do you motivate and inspire your team to achieve department goals?",
      "expectedDuration": 2,
      "difficulty": "easy"
    },
    {
      "category": "leadership",
      "question": "Can you walk me through a time when you had to make a tough decision in managing the online marketing department? How did you approach it?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "sales",
      "question": "How do you approach driving online marketing sales campaigns in collaboration with the sales team?",
      "expectedDuration": 2,
      "difficulty": "medium"
    },
    {
      "category": "sales",
      "question": "Explain your experience managing client accounts on Facebook and Google. How do you ensure optimal account setup and optimization?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "technical",
      "question": "What strategies have you found successful in managing KPIs to grow department revenue and client base?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "technical",
      "question": "How do you stay current with online marketing trends and tools, especially in the real estate industry?",
      "expectedDuration": 2,
      "difficulty": "easy"
    },
    {
      "category": "experience-based",
      "question": "Can you provide examples of your experience using Meta Business Suite, Canva, and Facebook Ads in your previous roles?",
      "expectedDuration": 3,
      "difficulty": "medium"
    },
    {
      "category": "experience-based",
      "question": "How have you managed financial aspects of marketing campaigns in your previous positions? Any notable successes or challenges?",
      "expectedDuration": 3,
      "difficulty": "medium"
    }
  ],
  "createdAt": "2025-04-12T13:39:44.330Z"
}